app/Controllers/Buku.php

SELECT *
FROM `buku`
WHERE `kategori` = 'Sosial & Sejarah'
ORDER BY `id_buku` DESC
SELECT *
FROM `buku`
ORDER BY `id_buku` DESC
---
   public function index()
{
    // 1. Ambil data dari URL (cari dan kategori)
    $keyword  = $this->request->getGet('cari');
    $kategori = $this->request->getGet('kategori');

    // 2. Inisialisasi Builder
    $builder = $this->bukuModel->builder();

    // 3. Logic Pencarian Teks
    if ($keyword) {
        $builder->groupStart()
                ->like('judul', $keyword)
                ->orLike('penulis', $keyword)
                ->orLike('isbn', $keyword)
                ->groupEnd();
    }

    // 4. Logic Filter Kategori (Ini yang bikin REAKSI!)
    // Kita cek jika kategori ada dan bukan "Semua"
    if ($kategori && $kategori != 'Semua') {
        $builder->where('kategori', $kategori);
    }

    $data = [
        'title'         => 'Daftar Buku',
        'list_kategori' => [
            'Semua', 'Umum', 'Agama', 'Sains & Teknologi',
            'Sosial & Sejarah', 'Bahasa & Sastra', 'Seni & Rekreasi'
        ],
        // 5. Eksekusi Query (Gunakan get()->getResultArray() untuk builder)
        'buku'          => $builder->orderBy('id_buku', 'DESC')->get()->getResultArray(),
        'keyword'       => $keyword,
        'kategori_now'  => $kategori // Kirim balik biar dropdown tetap terpilih
    ];

INSERT INTO `buku` (`judul`, `penulis`, `isbn`, `kategori`, `penerbit`, `tahun_terbit`, `stok`, `deskripsi`, `denda_per_hari`, `cover`) VALUES ('Tetralogi Buru', 'Pramoedya Ananta Toer', '978-979-97312-3-4', 'Sosial & Sejarah', 'Lentera Dipantara', '1980', '7', '', '5000', '1776961885_9442e5c58e9fb9ecec80.jpg')
---
    public function simpan()
    {
        // FIX: Tambahkan kategori, isbn, dan tahun_terbit agar tidak strip (-) lagi!
        $data = [
            'judul'          => $this->request->getPost('judul'),
            'penulis'        => $this->request->getPost('penulis'),
            'isbn'           => $this->request->getPost('isbn'),
            'kategori'       => $this->request->getPost('kategori'), // Sesuai kolom DB
            'penerbit'       => $this->request->getPost('penerbit'), // Sesuai kolom DB
            'tahun_terbit'   => $this->request->getPost('tahun_terbit'), // Sesuai kolom DB
            'stok'           => $this->request->getPost('stok'),
            'deskripsi'      => $this->request->getPost('deskripsi'),
            'denda_per_hari' => $this->request->getPost('denda_per_hari'),
        ];

        $fileCover = $this->request->getFile('cover');

        if ($fileCover && $fileCover->isValid() && !$fileCover->hasMoved()) {
            $namaGambar = $fileCover->getRandomName();
            $fileCover->move('uploads/cover', $namaGambar);
            $data['cover'] = $namaGambar;
        }

        $this->bukuModel->save($data);