app/Controllers/Users.php

    public function index()
    {
        // Menangkap data pencarian dan filter role dari URL (parameter GET)
        $keyword = $this->request->getGet('keyword');
        $role    = $this->request->getGet('role');

        // Menggunakan instance model sebagai query builder
        $builder = $this->users;

        // Logic Filter Kata Kunci (mencari di kolom Nama, Username, atau Email)
        if ($keyword) {
            $builder->groupStart() // Mulai pengelompokan query WHERE ( ... )
                    ->like('nama', $keyword)
                    ->orLike('username', $keyword)
                    ->orLike('email', $keyword)
                    ->groupEnd(); // Akhiri pengelompokan query
        }

        // Logic Filter Jabatan/Role jika dipilih
        if ($role) {
            $builder->where('role', $role);
        }

        // Mengambil data user, diurutkan dari yang terbaru, dibatasi 10 data per halaman
        $data['users'] = $builder->orderBy('id', 'DESC')->paginate(10, 'default');
---
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`

    public function edit($id)
    {
        // Mengambil satu data user dari tabel berdasarkan Primary Key-nya
        $data['user'] = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'